In [1]:
import pandas as pd

In [3]:
df1 = pd.read_excel('./monther.xls')
df1

   id name sex  age
0   1   张三   女   33
1   2   李四   女   32

In [16]:
df2 = pd.read_excel('./child.xls')
df2

   id name  age sex  mid
0   1   小明    3   男    1
1   2   小里    3   男    2
2   3   小强    3   男    1

In [6]:
df1['mid'] = 1
df1

   id name sex  age  mid
0   1   张三   女   33    1
1   2   李四   女   32    1

In [7]:
df1.loc[1,'mid'] = 2
df1

   id name sex  age  mid
0   1   张三   女   33    1
1   2   李四   女   32    2

In [17]:
pd.merge(df1,df2, how = 'inner', on = 'mid')

   id_x name_x sex_x  age_x  mid  id_y name_y  age_y sex_y
0     1     张三     女     33    1     1     小明      3     男
1     1     张三     女     33    1     3     小强      3     男
2     2     李四     女     32    2     2     小里      3     男